{
    "Mandarin": [
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN0piWjV3RRAB",
            "author_id": "101734368331063605180",
            "name": "April Wong",
            "text": "Okay… so I haven’t visited a Mandarin for a very long time but every time I do go, it would be this location since it’s the closest to downtown.\n\nI must note that this was probably the best experience I’ve had from any restaurant to be honest! Especially on Lunar New Year where it’s very busy, I was surprisingly shocked that I was met with excellent service!\n\nFrom the moment I called in to make reservations, Jenny on the phone was so nice!\n\nWhen I got to the restaurant I was let in and the hostess was so nice welcoming us! I then I had a person walk us to our table and gave us a light tour of the buffet selections and directed us where the washroom was.\n\nAs soon as we got to our table, Joe welcomed us with enthusiasm and hospitality! He was really nice, hardworking and working the room with such grace!\n\nAlways clearing our table, refilling our sodas/water/napkins. Where he was occupied with other tables, the service team was so strong. They would refill our beverages, check on our table. Even the co-owner I think Patty (I think) introduced herself and asked how our experience was - she was really pleasant!\n\nThe restaurant was so nicely decorated  and clean! The food was fresh and I loved how much variety there was.\n\nI have to give this experience 100/100 because everything was perfect, and I was just honestly so impressed by the hardworking team Mandarin has! Very hospitable and welcoming - I highly recommend this spot and will come back again (when I regain my appetite again hahaha).",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3FEUXNnRRAB",
            "author_id": "105091209559555070645",
            "name": "Yevheniia",
            "text": "We celebrated a birthday at Mandarin Restaurant, and it was a wonderful experience! They activated a coupon for us, so the birthday person enjoyed a free meal along with a cute cupcake and candle—such a nice touch. The staff was incredibly friendly and encouraged us to enjoy as much as we liked without hesitation. Myles, the managing partner, even stopped by to chat, adding a personal touch to our visit.\n\nThe menu was nearly the same as last year but still just as delicious—definitely left satisfied! I also love their tradition of fortune cookies and candies as you leave. Overall, a great place for celebrations and good food!",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN2JxbXhRRRAB",
            "author_id": "105353286706845476679",
            "name": "Nicole Alexis",
            "text": "I'm so glad I made a reservation because it was busy. We arrived on time and were promptly seated.\n\nIt was a perfect Family Day lunch and everyone had their food cravings satisfied. It was a great value for the Holiday lunch; under $50 with the Tropical Punch.\n\nI'm on a low carb journey so I definitely had my fill of salads, veggies and a variety of proteins. I ate more than the pics I posted lol 😆 #BigBackStatusAchieved\n\nFresh and delicious food paired with fantastic customer service from Dyan and Anson.\n\nThe restaurant was clean and not too crowded.\n\nI will definitely come back again and this location!!!!",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeV9qSXZBRRAB",
            "author_id": "113792094648955995666",
            "name": "Dinah-Faith G",
            "text": "We came here to celebrate 2 birthdays. We came in a group of 7 and we made reservations for 6:30pm. If you plan on coming to this location, you have to keep in mind that this is probably the only location for the heart of downtown Toronto, so it gets busy and you will have to wait to be seated despite making reservations for a specific time. The food was good, the service was great and the overall atmosphere was what you'd expect from a buffet 😆. Definitely worth a visit, and a heads up if you're celebrating a birthday, it's free if you sign up for the birthday coupon online ahead of time and if you're in a group of min 3 people. Definitely would come back for another special occasion 🥳🎂",
            "rating": "4 stars"
        },
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbFByNjdBRRAB",
            "author_id": "115003415605898134542",
            "name": "G P",
            "text": "I am a frequent visitor to Toronto for over 40 years. Ever since I discovered Mandarins over 20 years ago it has become one of my favorite restaurants in Toronto. The food is varied, fresh and well-seasoned. It has been a few years since I ate here ( before 2020), and there seems to be more options than before, especially desserts. The decor, music and ambiance all feel authentic and adds to the experience.\n\nOn Jan 20th 2025 my wife and I had lunch buffet there and everything was wonderful as I have come to expect. We were served by AMY who has a wonderful energy and personality,  5 star service!!!\n\nWe will be back!!\n\nGreg and Liz from Bermuda : )",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaFB1ZHRBRRAB",
            "author_id": "115536377833791338437",
            "name": "Gel",
            "text": "I love visiting Mandarin Yonge location. The food is always fresh and delicious with an assortment of selections. Our servers Penny and Joe were so great and nice. We even interacted with the managers, Paddy and James, who were very friendly and nice. The decorations right now at the restaurant are very festive with Chinese New Year, can't wait to come back next week for their Chinese New Year promotion. Always 5 star service at Mandarin Yonge.",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3N6UmRnEAE",
            "author_id": "100066821235004048150",
            "name": "Lex Allison",
            "text": "Lovely experience and really good buffet food! Great selection, lots of cute birthdays being celebrated. And Penny was THE BEST server",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJg482lDwzK4gRXv0WroRd75o",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbzhTd0V3EAE",
            "author_id": "104026449103104686591",
            "name": "Jim Butler",
            "text": "Unbelievable endless fried shrimp, peel and eat, sushi, roast beef, BBQ ribs, pastas, salmon, chicken, salads, and desserts.  All you can eat at fixed price.  Discounts available for children and seniors.  Alcohol available.",
            "rating": "4 stars"
        }
    ],
    "Chi_Dim_Sum": [
        {
            "google_id": "ChIJzbPHU2kzK4gR73VsQjuddc4",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NnBLMi1RRRAB",
            "author_id": "103601239756747662836",
            "name": "Kaplan Media Group",
            "text": "Tried the special, very good! A small bowl of wonton which was fantastic and a nice plate of red sauced chicken w white rice. Added a bit of hot sauce. Service was good perhaps too keen, they came by too many times, perhaps it's a thing overseas but I'd like my meals undisturbed. Overall a great edpericne, nice tasty and clean.",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJzbPHU2kzK4gR73VsQjuddc4",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOGNPakh3EAE",
            "author_id": "115046821128808103776",
            "name": "Mindy",
            "text": "The food was overall yummy. We had the Peking duck. They also gave us a roll I think of crunchy spicy salmon sushi which was really nice of them and that tasted good as well. We heard that the duck was tableside service but it wasn’t, and it also looked a bit old so we were kind of skeptical but it tasted good. Otherwise the staff were really nice and the price is pretty cheap.",
            "rating": "3 stars"
        },
        {
            "google_id": "ChIJzbPHU2kzK4gR73VsQjuddc4",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudHVDallBEAE",
            "author_id": "108422947155213030713",
            "name": "Tatcha P.",
            "text": "The food here is good! I love the tofu and dim sum! Julia is the best! She is so friendly and lovely. We also got complimentary ice cream. I have no complaints about my visit. We will definitely come back!",
            "rating": "5 stars"
        }
    ],
    "Haru_Shabu_Shabu": [
        {
            "google_id": "ChIJuSVU9z0tK4gRetZ-7X7G7U8",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNUx2ekRnEAE",
            "author_id": "117064085821417863822",
            "name": "Brandon C",
            "text": "Solid spot for all you can eat hotpot, but I personally prefer some of the other ayce hotpot spots over this.\n\nThe ingredients were fine but wasn't anything amazing, especially considering the price. We got the dinner menu and two broths and it came out to something like $110+ for two people.\n\nFound the service to be somewhat hit/miss at times. Sometimes they would be really attentive and come over quite frequently, but there were stretches of time where everyone disappeared and you couldn't find anyone to flag down.\n\nOverall not a bad option but imo there are better places out there.",
            "rating": "4 stars"
        },
        {
            "google_id": "ChIJuSVU9z0tK4gRetZ-7X7G7U8",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aElHYXJ3RRAB",
            "author_id": "109560190352223584905",
            "name": "Uliana Selina",
            "text": "Yesterday, I had dinner at this incredible place! 🍲 It was my first time trying hot pot, and what an amazing experience it was!\n\nThe atmosphere in the restaurant is absolutely charming, with beautiful decorations that truly set the mood. ✨ Everything was impeccably clean and felt quite fancy.\n\nOur server was delightful—so friendly and attentive, always checking in on us. The manager also stopped by a few times to ensure we were enjoying our meal.\n\nWe indulged in a variety of meats and seafood 🦞, and I couldn't get over how cute those little bags were!\n\nCheck out all the pictures below! 👇🏻😊",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJuSVU9z0tK4gRetZ-7X7G7U8",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJemF1YnZRRRAB",
            "author_id": "117289056090758603473",
            "name": "Angie NG",
            "text": "I had an amazing experience at this Japanese Sukiyaki hotpot restaurant. The broth was rich and flavorful, perfectly balanced with sweet and savory notes. The selection of fresh ingredients like tender beef, vegetables, and tofu was excellent. The service was attentive and friendly, making the dining experience even better. Highly recommend for anyone craving authentic Japanese hotpot. A must-try spot",
            "rating": "5 stars"
        }
    ],
    "Gols_Lanzhou_Noodle": [
        {
            "google_id": "ChIJa2UdKGstK4gRkJXxrVppC6s",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZzd5aUhBEAE",
            "author_id": "106114518587374779559",
            "name": "Angelika G",
            "text": "Beef broth & noodles were great! Noodles are made in-house and you can pick their thickness. Although there were other noodles shapes mixed in with the one we ordered, we didn’t mind. Those plates tasted well.\n\nWe did not enjoy the squid as it had too many BBQ spices on it (interesting that many others else also said this on reviews but we didn’t see those prior). So yes, confirming this as well!\n\nServer was kind and explained everything. Food was brought out very quickly.\n\nLots of space, lively yet peaceful. Would definitely visit again for stir fry!",
            "rating": "4 stars"
        },
        {
            "google_id": "ChIJa2UdKGstK4gRkJXxrVppC6s",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmanViZElBEAE",
            "author_id": "109672325723378344468",
            "name": "Jelena P",
            "text": "Beef noodle soup was very taste and you can pick your hand pulled noodle thickness. We didn’t enjoy the BBQ squid - the spices were too strong and not very tasty. Service was excellent. Nice spot for a quick bite and tasty soup.",
            "rating": "4 stars"
        },
        {
            "google_id": "ChIJa2UdKGstK4gRkJXxrVppC6s",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MU4zQmtBRRAB",
            "author_id": "112214236185783309978",
            "name": "Vay",
            "text": "Good food, good portions. Got the regular size beef noodles and the lamb stir fry noodles for 2 people. we ended up taking the stir fry home for dinner. Staff are all super friendly and helpful. I also really like that you can have all the green onions and cilantro come separately, so you can add to taste. Same with the chili oil! Each table has its own jar of chili oil, so you can ask for non-spicy and just add to your liking.",
            "rating": "5 stars"
        }
    ],
    "Sang-Ji_Fried_Bao": [
        {
            "google_id": "ChIJ_2xCxagtK4gR6CBsIsW8uD4",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMFllOTVRRRAB",
            "author_id": "113780687368100722414",
            "name": "Melissa Kruse",
            "text": "One of my parents favorite restaurants. Sangji bao are so delicious with lots of soup inside. Savory soy cream soup is also very tasty.",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJ_2xCxagtK4gR6CBsIsW8uD4",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanZtQkVnEAE",
            "author_id": "113552509787175170028",
            "name": "Shirley Xu",
            "text": "The pan-fried bao was quite good, but the menu options were too limited, even basic vegetables were missing. We ordered the fried bao, shepherd’s purse wontons, and brown sugar glutinous rice cakes. While the bao was enjoyable, the other two dishes were just average.",
            "rating": "3 stars"
        },
        {
            "google_id": "ChIJ_2xCxagtK4gR6CBsIsW8uD4",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMXNlT2h3RRAB",
            "author_id": "106771223696373188922",
            "name": "Vincent Chow",
            "text": "One of the long standing restaurants in the Yonge-Finch area, they were originally located as a small hole-in-the-wall restaurant under a condo complex and now as a standalone restaurant closer to Yonge and Finch. They are best known for their fried baos (soup dumplings), which are made fresh to order throughout the day along with other street food style items all for a decent price as most items are under $15.\n\nTheir baos come in orders of four per plate and are fried with the top side down, which helps to keep all the soup in under a thin, crispy dumpling wrapper. One order of baos can be filling even as a snack or as a light meal given their size. The other popular item is their Scallion Oil Noodles, which is a dry noodle dish that comes with noodles mixed in scallion oil, topped with peanuts and marinated scallions from the oil. The noodles were very flavourful and come with a strong taste of garlic.\n\nOverall, it is a popular spot in the area due to the food being great value for the area. As the restaurant tends to be fairly busy during peak times, expect to be a waiting list or be prepared to do takeout. Also, the restaurant is cash/debit only but paying cash provides a small discount on your order.",
            "rating": "5 stars"
        }
    ],
    "Noodle_Legand": [
        {
            "google_id": "ChIJcQoky-YtK4gRSdzx7YBolKA",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMTZpdmZBEAE",
            "author_id": "114251665145728582153",
            "name": "LEXY LIN",
            "text": "I always wanted to have a try as I read many positive reviews about this noodle restaurant. Now I can say many of those positive reviews are true, the noodles are really good. It’s hand-made noodle, not the machine-made style so it gives a perfect flavor of noodle. Further, what I really like and didn’t often see in other restaurants is that you can customize your flavor when you order. I don’t like too salty, strong taste and I was surprisingly happy to see that I can chose light salt and light oil options from the noodle I ordered.  We also ordered a side dish of sliced potatoes- very crispy and great!\n\nOverall I like this restaurant, in my mind it’s one of the best noodle place in Toronto. Good for an easy and quick meal, particularly in winter - a warm bowl of noodle would make your day nice and warm :)",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJcQoky-YtK4gRSdzx7YBolKA",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbzhuMjR3RRAB",
            "author_id": "117767341678351861719",
            "name": "D Chang",
            "text": "A nice variety of soup and dry thick noodles.  Seating is tight, they can’t accommodate for tables over 4 people.\n\nThe service was good up until payment when they said cash or debit only but in fact they do accept credit cards if you insist.  Not a pleasant way to end an otherwise good lunch.\n\nAlso, the review scores are so high because they solicit 5 star reviews for a free appetizer…….",
            "rating": "3 stars"
        },
        {
            "google_id": "ChIJcQoky-YtK4gRSdzx7YBolKA",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaE1xYkV3EAE",
            "author_id": "107429607208263908950",
            "name": "Vivian Do",
            "text": "My boyfriend found this place and wanted to give a try. First time, i checked the menu and they all look so good, so different and authentic. We decided to spend the weekend here, very first thing impressed us that the staff here  are very friendly, kind, nice and polite. The place is clean and tidy.\nThen when the food came out, they were exactly like the pictures. But the taste blew our mind, omg they are all so good, so tasty and flavouful. This is a MUST try place if you are looking for quality food but friendly and quite atmosphere, it will bring you back feeling like hometown. We love this place and def will bring our friends/family here next time\n****Shout out for Michael, the most gentle and thoughtful waiter. Thank you!",
            "rating": "5 stars"
        }
    ],
    "The_Keg_Steakhouse": [
        {
            "google_id": "ChIJ8V5uCXXL1IkRNk8ClsLjfwk",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveWVmanBnRRAB",
            "author_id": "112165138948304502591",
            "name": "Sharmaine",
            "text": "Visited The Keg for an evening dinner at their Sheppard-Yonge location!\n\nThe dining area was exquisite and very dim, with an array of seating at booths and bars. Reservations are recommended especially on weekends.\n\nThe service was amazing and our waiter was very attentive to our requests and orders. We have ordered the Calamari, Prime Rib, Top Sirloin, and a complimentary side of bread, which came with amazing garlic butter!\n\nThe drinks we ordered were the Agua Fresca which did not the taste the way I expected, and the Tropical Spritz, which was the better drink from the two. Their selections of Wines, Spirits, and Drinks cater to different tastes and preferences, especially pairing with their Steaks.\n\nGood experience here! Will come again",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJ8V5uCXXL1IkRNk8ClsLjfwk",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aU4zX1h3EAE",
            "author_id": "117347685026105224244",
            "name": "Wilson C",
            "text": "Had a wonderful anniversary dinner with kids.  Service is great as my kid has allergy and they ensure the food is safe.  The kids meal comes with veggie platter and my kid picked the sirloin with veggie.  I picked prime rib myself.  Everything cooked at the right temperature.  Sometimes, when you order medium and it became medium well.  This is not the case here.  There’s few the Keg locations around and I picked this one mainly for reviews with good service.  And they don’t disappoint me .",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJ8V5uCXXL1IkRNk8ClsLjfwk",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMWRyTnlRRRAB",
            "author_id": "101159142221114177918",
            "name": "Sepehr Bahrami",
            "text": "I recently had the pleasure of dining at The Keg Steakhouse for the second time, and it was an unforgettable experience from start to finish. From the moment we walked in, we were warmly greeted by the friendly staff and seated in a beautifully designed, cozy atmosphere that set the stage for a fantastic evening.\n\nThe service was outstanding—our server was knowledgeable, attentive, and made excellent recommendations. The timing of each course was perfect, and we never felt rushed or neglected.\n\nNow, onto the food—absolutely phenomenal! The steaks were cooked to perfection, seasoned beautifully, and melted in our mouths. The 20 OZ Rib Steak , in particular, was one of the best I’ve ever had—tender, juicy, and packed with flavor. The sides were just as impressive, from the creamy garlic mashed potatoes to the perfectly grilled mushrooms. We also tried their signature appetizers, and every bite was a delight. I recommend the Tuna Tartare.\n\nThe Keg’s cocktail and wine selection perfectly complemented the meal, making the dining experience even more enjoyable. Whether you’re celebrating a special occasion or just looking for a top-notch steakhouse, The Keg delivers on every level.\n\nI highly recommend this place and can’t wait to return!",
            "rating": "5 stars"
        }
    ],
    "Cafe_Landwer": [
        {
            "google_id": "ChIJgW-LNkctK4gRRiyrNDeepDM",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2Vlel9nRRAB",
            "author_id": "116422672246091895820",
            "name": "gayatri mohan",
            "text": "A nice brunch place on Yonge st. Their cortado coffee and black coffee is quite refreshing. We tried butter croissants and they were very buttery and freshly baked.\n\nFor brunch we tried falafel plate, beef roast sandwich, chicken sandwich and truffle mushroom pasta. Over all the food is great with good portion size. We felt few of the things like falafels were quite oily, but their hummus and pita bread was delicious. The ambience of the place is quite decent with slightly a retro feel.\n\nFor sure a recommended brunch spot!",
            "rating": "4 stars"
        },
        {
            "google_id": "ChIJgW-LNkctK4gRRiyrNDeepDM",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvODhlU2FBEAE",
            "author_id": "117537286857243829748",
            "name": "Simon Siu",
            "text": "The Cobb salad was delicious. The restaurant is always crowded but they only have 2 waitresses to serve all the tables. We have to wait to order and get our bills for a long time.\n\nThey didn’t have any beers on the menu except Guinness. My friend ordered a Cajun chicken with 2 sides - Brussel sprouts and Japanese sweet potatoes. He wanted to upgrade the sprouts to French fries. But when he got the food, there were no sweet potatoes. The waitress explained with the fries upgrade, he would not get the sweet potatoes. What a weird policy! The manager later gave him some sweet potatoes after he complained about it.",
            "rating": "4 stars"
        },
        {
            "google_id": "ChIJgW-LNkctK4gRRiyrNDeepDM",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva2ZiYkhREAE",
            "author_id": "107564873029926256562",
            "name": "Ghazal Ghasempour",
            "text": "It is great place to hangout with friends and family and enjoy the food. We had breakfast and really enjoyed the almond croissant, Belgian waffle, eggs Benedict. The coffee was great too.",
            "rating": "5 stars"
        }
    ],
    "Chicken_Plus_The_Bar": [
        {
            "google_id": "ChIJYVhDdwEtK4gRhreN1SVVj-E",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJei0ybUNnEAE",
            "author_id": "117389152749410852782",
            "name": "Geena You",
            "text": "Chicken Plus is my son and daughter's favorite snack. It's the perfect chicken of crispy on the outside and tender on the inside, and the taste is absolutely amazing.\n\nChicken makes every mealtime so much happier. The cheeseballs feel like an extra bonus. I highly recommend it!😊👍",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJYVhDdwEtK4gRhreN1SVVj-E",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbHF1a0VBEAE",
            "author_id": "105817990751292409732",
            "name": "Rue Martin",
            "text": "Freshly made chicken tenders, the chicken was so juicy and the flavor was absolutely delicious!\nI had the honey chicken, sauce on the side because the flavor might be overpowering.\nThe staff were super friendly\nHighly recommend it!",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJYVhDdwEtK4gRhreN1SVVj-E",
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNneHJBUhAB",
            "author_id": "105054084621047704782",
            "name": "Samuel Guest",
            "text": "The quality of the boneless wings was great. I also appreciated the wedges and rice cakes included. I did take-out. I would prefer it that way after seeing the inside. It is definitely more of a bar vibe which some folks would like.",
            "rating": "5 stars"
        }
    ],
    "Grill_Gate": [
        {
            "google_id": "ChIJEWtiNDctK4gR_jGIX4wnSBs",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbWVlRDBBRRAB",
            "author_id": "117568394643670730940",
            "name": "Anastasiya Vishnyakova",
            "text": "Great experience at Grill Gate! The burger and Philly cheesesteak were delicious, the fries came with a great sauce, and we loved that the food wasn’t overly salty. Friendly atmosphere, too. we'll definitely be back!",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJEWtiNDctK4gR_jGIX4wnSBs",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3al9lMzd3RRAB",
            "author_id": "103030642426234295460",
            "name": "Hoda A",
            "text": "We had an incredible experience at Grill Gate! Everything about this restaurant exceeded our expectations—impeccably clean, delicious food, and a great location. The pizza and sandwiches were absolutely amazing, full of flavor and made with high-quality ingredients.\n\nWhat truly set this place apart was the outstanding service. The staff went above and beyond to make us feel welcome, showing such kindness not only to us but especially to our toddler. Their warmth and hospitality made it feel like we were having dinner at a friend’s place.\n\nHighly recommend Grill Gate to anyone looking for a fantastic meal with exceptional service! We’ll definitely be back.",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJEWtiNDctK4gR_jGIX4wnSBs",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dzU2Q2NnEAE",
            "author_id": "116981776381234889939",
            "name": "Ms. Fé",
            "text": "Customer service is friendly. The lunch special is worth it. Everything is fresh and of quality. The burger was buttery, piled high with crisp lettuce, the house sauce I think has an hint of lemon and what distincts this place is they grill the mozzarella so it’s crispy! The sesame seed bun is also fresh from a bakery. So good.",
            "rating": "5 stars"
        }
    ],
    "Hazels_Diner": [
        {
            "google_id": "ChIJlVSHh40yK4gRfKPHlCX5pJg",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaHBDQnlnRRAB",
            "author_id": "113239631491551854352",
            "name": "Zahra Abbasi",
            "text": "We visited Hazel’s Diner recently, and unfortunately, it didn’t leave a great impression. The first thing I noticed was a layer of dust on the front counter, which wasn’t very inviting. On top of that, the dishes on our table weren’t cleaned properly, which was disappointing.\n\nI ordered The Caker, but it was really dry and lacked flavor, making the meal pretty underwhelming.\n\nThe one positive was the server, who was friendly, respectful, and very attentive. She genuinely tried to make the experience better, and her excellent service is the only reason I’m giving 2 stars instead of 1.\n\nHazel’s Diner has potential, but they need to focus more on cleanliness and the quality of their food if they want to stand out.",
            "rating": "2 stars"
        },
        {
            "google_id": "ChIJlVSHh40yK4gRfKPHlCX5pJg",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLV83Yk5nEAE",
            "author_id": "111760021878162761374",
            "name": "Ilia Makedonov",
            "text": "The service was good and the sausage was flavourful. However, the food was too oily and some of the vegetables were burned. This diner is a good option if you are looking for a quick breakfast but avoid it if you care about the quality of the food. Prices were very reasonable, given the premium location.",
            "rating": "4 stars"
        },
        {
            "google_id": "ChIJlVSHh40yK4gRfKPHlCX5pJg",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMGFUNGlRRRAB",
            "author_id": "102104138425961185207",
            "name": "Angelina Schwartz",
            "text": "Amazing food and service. Even with a full house you will receive the best attention and service! Another great tip is there is real milk and cream for coffee no milkettes.",
            "rating": "5 stars"
        }
    ],
    "La_Vecchia_Restaurant_Uptown": [
        {
            "google_id": "ChIJa5o8oSMzK4gR5Lbbne-B_E8",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRa2Nielp3EAE",
            "author_id": "109795334258204622108",
            "name": "Alexus Tang",
            "text": "I overall liked my experience here! It's nice and cozy, but not overly fancy. The ambiance is a bit dark.\n\nThe menu has plenty of appetizers, pasta, and pizza options. The best thing we had was the sacchetti al tartufo pasta - it was rich, creamy, and delicious. I also really liked the tagliere di salumi (meat & cheese board) - the bread was surprisingly amazing and tasted really good with the fruit jam that it came with.\n\nThe rest of the items were decent to good:\n- branzino alla griglia (nothing outstanding, I've had better fish elsewhere)\n- gioia pizza (sounded really good but tasted average)\n- rigatoni romani (it was a bit soggy and the flavours blended together in a way that didn't really make me enjoy the dish)\n\nThe service was nice. The prices skew towards being more on the expensive side. It was a good spot for my boyfriend's mom's birthday dinner, and I would come back once in a while to try other items.\n\n7/10",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJa5o8oSMzK4gR5Lbbne-B_E8",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcDhtNTVnRRAB",
            "author_id": "114951779447078554856",
            "name": "thakur apurva",
            "text": "Very unexpected visit we had while walking after dinner , n so we went in to get couple of drinks n my God total worth it. Sadly I forgot the name of the drink , one was something “Amalfi” …. Such balanced and artistic cocktails.\nPlace looks real cozy n dim lighted , perfect for anniversary/ proposal:)\nService 10/10 .\nDefinitely going for pasta 🍝 real soon .",
            "rating": "5 stars"
        },
        {
            "google_id": "ChIJa5o8oSMzK4gR5Lbbne-B_E8",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneGEyZjZRRRAB",
            "author_id": "116030422440198200855",
            "name": "Nehal Chaudhari",
            "text": "Me and my husband went for birthday dinner. Service was amazing from start to end. Staff was very attentive even gave us suggestions for some of the best drinks and food. everything was great including vibes, atmosphere, staff, food. And they made my day by giving me surprise birthday dessert. I would absolutely love to be back soon.",
            "rating": "5 stars"
        }
    ]
}